{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u00ec\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32", "trainable": true, "output_shape_type": "raw", "batch_input_shape": [null, 64, 64, 3], "arguments": {}, "name": "lambda_1", "function_type": "lambda", "output_shape": null}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "trainable": true, "init": "glorot_uniform", "nb_row": 5, "activity_regularizer": null, "bias": true, "b_constraint": null, "nb_filter": 24, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "border_mode": "valid", "name": "convolution2d_1", "subsample": [2, 2], "W_constraint": null, "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "trainable": true, "init": "glorot_uniform", "nb_row": 5, "activity_regularizer": null, "bias": true, "b_constraint": null, "nb_filter": 36, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "border_mode": "valid", "name": "convolution2d_2", "subsample": [2, 2], "W_constraint": null, "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "trainable": true, "init": "glorot_uniform", "nb_row": 5, "activity_regularizer": null, "bias": true, "b_constraint": null, "nb_filter": 48, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "border_mode": "valid", "name": "convolution2d_3", "subsample": [2, 2], "W_constraint": null, "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "trainable": true, "init": "glorot_uniform", "nb_row": 3, "activity_regularizer": null, "bias": true, "b_constraint": null, "nb_filter": 64, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "border_mode": "valid", "name": "convolution2d_4", "subsample": [1, 1], "W_constraint": null, "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "trainable": true, "init": "glorot_uniform", "nb_row": 3, "activity_regularizer": null, "bias": true, "b_constraint": null, "nb_filter": 64, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "border_mode": "valid", "name": "convolution2d_5", "subsample": [1, 1], "W_constraint": null, "dim_ordering": "tf"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "init": "glorot_uniform", "input_dim": 64, "bias": true, "b_constraint": null, "b_regularizer": null, "output_dim": 1164, "W_regularizer": null, "activation": "relu", "activity_regularizer": null, "name": "dense_1", "W_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_1", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "init": "glorot_uniform", "input_dim": 1164, "bias": true, "b_constraint": null, "b_regularizer": null, "output_dim": 100, "W_regularizer": null, "activation": "relu", "activity_regularizer": null, "name": "dense_2", "W_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "init": "glorot_uniform", "input_dim": 100, "bias": true, "b_constraint": null, "b_regularizer": null, "output_dim": 50, "W_regularizer": null, "activation": "relu", "activity_regularizer": null, "name": "dense_3", "W_constraint": null}}, {"class_name": "Dense", "config": {"trainable": true, "init": "glorot_uniform", "input_dim": 50, "bias": true, "b_constraint": null, "b_regularizer": null, "output_dim": 1, "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "name": "dense_4", "W_constraint": null}}], "keras_version": "1.2.0"}